{
  "name": "sequential",
  "layers": [
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": "float32",
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": "float32",
        "units": 256,
        "activation": "relu",
        "use_bias": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": "float32",
        "units": 128,
        "activation": "relu",
        "use_bias": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": "float32",
        "units": 64,
        "activation": "relu",
        "use_bias": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_3",
        "trainable": true,
        "dtype": "float32",
        "units": 10,
        "activation": "softmax",
        "use_bias": true
      }
    }
  ]
}